app/Http/Controllers/ProductController.php

select * from `categories`
select * from `products`
---
    public function index()
    {
        $categories = Category::all();
        $products = Product::all();

insert into `products` (`name`, `description`, `price`, `picture`, `weight`, `quantity`, `available`, `category_id`) values ('fesfe', 'efefef', '62', 'ffe.jpg', '22', '2', 1, 1)
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'name' => 'required',
            'price' => 'required|gte:1',
            'quantity' => 'required|min:1',
//            'picture' => 'required',
            'weight' => 'required|min:1',
            'description' => 'required|min:5',

        ]);
        $produit = new Product();
        $produit->name = $request->name;
        $produit->description = $request->description;
        $produit->price = $request->price;
        $produit->picture = $request->image;
        $produit->weight = $request->weight;
        $produit->quantity = $request->quantity;
        $produit->available = $available = 1;
        $produit->category_id = $category_id = 1;
        $produit->save();

select * from `products`
---
    public function suppr()
    {
        $product = Product::all();

delete from `products` where `id` = 22
---
    public function delete($id)
    {
        $product = Product::destroy($id);